{
  "_name_or_path": "StanfordAIMI/RadLLaMA-7b",
  "architectures": [
    "u2LlamaForCausalLM"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "auto_map": {
    "AutoConfig": "configuration_m3d_u2.u2Config",
    "AutoModelForCausalLM": "modeling_m3d_u2.u2LlamaForCausalLM"
  },
  "bos_token_id": 1,
  "eos_token_id": 2,
  "hidden_act": "silu",
  "hidden_size": 4096,
  "image_channel": 1,
  "image_size": [
    32,
    256,
    256
  ],
  "initializer_range": 0.02,
  "intermediate_size": 11008,
  "max_position_embeddings": 4096,
  "mm_hidden_size": 768,
  "mm_projector_type": "spp",
  "model_type": "u2llama",
  "num_attention_heads": 32,
  "num_hidden_layers": 32,
  "num_key_value_heads": 32,
  "patch_size": [
    4,
    16,
    16
  ],
  "pretraining_tp": 1,
  "proj_layer_num": 2,
  "proj_layer_type": "mlp",
  "proj_pooling_size": 2,
  "proj_pooling_type": "spatial",
  "rms_norm_eps": 1e-05,
  "rope_scaling": null,
  "rope_theta": 10000.0,
  "seg_token_id": 32003,
  "segmentation_module": "segvol",
  "tie_word_embeddings": false,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.35.2",
  "use_cache": true,
  "vision_select_feature": "patch",
  "vision_select_layer": -1,
  "vision_tower": "vit3d",
  "vocab_size": 32005
}
