{
  "_name_or_path": "/home/baifan/PycharmProjects/M3D_hf/M3D_u2phi3/weight/Phi-3-mini-4k-instruct",
  "architectures": [
    "u2Phi3ForCausalLM"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "auto_map": {
    "AutoConfig": "configuration_m3d_u2.u2Phi3Config",
    "AutoModelForCausalLM": "modeling_m3d_u2.u2Phi3ForCausalLM"
  },
  "bos_token_id": 1,
  "embd_pdrop": 0.0,
  "eos_token_id": 32000,
  "hidden_act": "silu",
  "hidden_size": 3072,
  "image_channel": 1,
  "image_size": [
    32,
    256,
    256
  ],
  "initializer_range": 0.02,
  "intermediate_size": 8192,
  "max_position_embeddings": 4096,
  "mm_hidden_size": 768,
  "mm_projector_type": "spp",
  "model_type": "u2phi3",
  "num_attention_heads": 32,
  "num_hidden_layers": 32,
  "num_key_value_heads": 32,
  "original_max_position_embeddings": 4096,
  "pad_token_id": 32000,
  "patch_size": [
    4,
    16,
    16
  ],
  "enable_u2tokenizer": true,
  "u2t_num_heads": 4,
  "u2t_num_layers": 2,
  "u2t_top_k": 1024,
  "use_multi_scale": true,
  "num_3d_query_token":256,
  "proj_layer_num": 2,
  "proj_layer_type": "mlp",
  "proj_pooling_size": 2,
  "proj_pooling_type": "spatial",
  "resid_pdrop": 0.0,
  "rms_norm_eps": 1e-05,
  "rope_scaling": null,
  "rope_theta": 10000.0,
  "seg_token_id": 32014,
  "segmentation_module": "segvol",
  "sliding_window": 2047,
  "tie_word_embeddings": false,
  "torch_dtype": "float32",
  "transformers_version": "4.42.0.dev0",
  "use_cache": true,
  "vision_select_feature": "patch",
  "vision_select_layer": -1,
  "vision_tower": "vit3d",
  "vocab_size": 32015
}
